spec.org
#+TITLE:     Stoic resources spec
#+AUTHOR:    G Andrieu
#+EMAIL:     ghiom@taleo-initiative.org
#+DATE:      2010-05-19 Wed
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:

* Project presentation

** Motivation
   Software development is growing a social way of working. Tools such
   as [[http://www.github.com][Github]] allow to share one's programs with other programmers, who
   may take the program, copy it on their own repository, work on it
   by themselves, and propose modifications. Then, useful
   contributions can be merged into the mother repository.

   There is no reason we could not apply the same kind of pattern to
   philosophy. People have thoughts worth sharing, worth
   adopting. Actually this kind of pattern is already used among
   intellectuals, musicians, etc. Everybody borrows from the others.
   But there is no infrastructure for doing so.

   But it is hard to genuinely borrow from Epictetus. Because his
   books have been translated into many different languages, many
   times, and without a careful study of the footnotes, and careful
   comparison between several editions, one may easily be mislead by
   the translator(s).

   The goal of the described application is to answer a certain number
   of issues, among which classical text accessibility, and ease in
   sharing one's thoughts among other people caring about the same
   topic. The application is not usable only by the stoic community,
   although the stoic community is its initial target. The same
   principle apply to any community whose common reference is mostly
   found in textual material.


* Considerations and responses

  This section presents the project by trying to list a certain number
  of considerations sorted by main themes. These considerations lead
  to informal business requirements that the application must
  address.

** About classical texts
*** Considerations expression
    + There is no global repository to find official or important texts
      in Stoicism.
    + There are many different versions of these texts, translated by
      many authors in many different languages. Some of them match in
      their table of contents, some other don't.
    + There is no easy way to refer to the original texts, nor to
      compare the different editions.

*** Responses to the considerations
    This document describes an application which:
      + hosts the reference texts,
      + allows to compare the editions easily.

    The users are able to:
      + collect references into personal anthologies,
      + comment or annotate parts of the reference texts.
      + export/render the reference opera or anthologies into booklets.


** About contemporary knowledge creation
*** Considerations expression
   + There are today's works which deserve to be treated as important
     advances to stoicism.
   + Nobody can tell today which of these works will be considered as
     classic texts in the future (if any).
   + The stoic community can group its efforts to produce important
     contributions to the stoic philosophy.

*** Responses to the considerations
    This document describes an application which:
      + allows anybody to create an 'author' account,
      + allows anybody to share his/her own texts,
      + allows anybody to allow anybody to copy and modify his/her own
        texts,
      + allows common efforts to be forked/merged, exactly the same way
        it is done in software development,
      + allows people to comment/annotate other people's texts,
      + render texts from other users as PDF books/booklets.


** About privacy and decentralization
*** Considerations expression
   + Personal data is a critical topic. Users of online
     services/applications become aware of their privacy and wish to
     have full rights over the content they have produced.
   + Different communities may generate content independently, and yet
     wish to share their product with other communities.

*** Responses to the considerations
    This document describes an application which:
    + proposes a protocol of communication between its different
      instances, so that each instance of the application is able
      to reference other instances and fetch data from them,
    + rests upon open architectures in matters of authentication to
      facilitate the user's navigation between servers,
    + allows users to easily restrict other user's access to their
      content.
    The fact that this application's usage may be spread accross many
    countries, with different legislations regarding intellectual
    property and copyrights, makes necessary that all users agree on
    terms of utilization. These terms are targeted at two goals :
    + allow people to protect the content they want to keep private (as
      hypomnemata, or work-in-progress translations, etc.),
    + encourage the sharing of knowledge, by making compulsorily public
      the content which has been borrowed from other people.


** About table of contents
