spec.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Stoic resources spec</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-05-19 07:33:19 CEST"/>
<meta name="author" content="subtenante"/>
</head><body>
<h1 class="title">Stoic resources spec</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Project presentation </a>
<ul>
<li><a href="#sec-1.1">1.1 Motivation </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Considerations and responses </a>
<ul>
<li><a href="#sec-2.1">2.1 About classical texts </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 Considerations expression </a></li>
<li><a href="#sec-2.1.2">2.1.2 Responses to the considerations </a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 About contemporary knowledge creation </a>
<ul>
<li><a href="#sec-2.2.1">2.2.1 Considerations expression </a></li>
<li><a href="#sec-2.2.2">2.2.2 Responses to the considerations </a></li>
</ul>
</li>
<li><a href="#sec-2.3">2.3 About privacy and decentralization </a>
<ul>
<li><a href="#sec-2.3.1">2.3.1 Considerations expression </a></li>
<li><a href="#sec-2.3.2">2.3.2 Responses to the considerations </a></li>
</ul>
</li>
<li><a href="#sec-2.4">2.4 About table of contents </a>
<ul>
<li><a href="#sec-2.4.1">2.4.1 Considerations expression </a></li>
<li><a href="#sec-2.4.2">2.4.2 Responses to the considerations </a></li>
</ul>
</li>
<li><a href="#sec-2.5">2.5 About internationalization </a>
<ul>
<li><a href="#sec-2.5.1">2.5.1 Considerations expression </a></li>
<li><a href="#sec-2.5.2">2.5.2 Responses to the considerations </a></li>
</ul>
</li>
<li><a href="#sec-2.6">2.6 Usage examples </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Concepts and Types of objects </a>
<ul>
<li><a href="#sec-3.1">3.1 Languages </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 Introduction </a></li>
<li><a href="#sec-3.1.2">3.1.2 GUI </a></li>
<li><a href="#sec-3.1.3">3.1.3 Data content categorization </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 Authors </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 Classic authors </a></li>
<li><a href="#sec-3.2.2">3.2.2 Quoted authors </a></li>
<li><a href="#sec-3.2.3">3.2.3 Private authors </a></li>
</ul>
</li>
<li><a href="#sec-3.3">3.3 Karma </a>
<ul>
<li><a href="#sec-3.3.1">3.3.1 Definition </a></li>
<li><a href="#sec-3.3.2">3.3.2 Scope</a></li>
<li><a href="#sec-3.3.3">3.3.3 Karma modification</a></li>
</ul>
</li>
<li><a href="#sec-3.4">3.4 Users </a>
<ul>
<li><a href="#sec-3.4.1">3.4.1 Typology </a></li>
<li><a href="#sec-3.4.2">3.4.2 User rights </a></li>
</ul>
</li>
<li><a href="#sec-3.5">3.5 Opera (repositories) </a>
<ul>
<li><a href="#sec-3.5.1">3.5.1 Classic opera </a></li>
<li><a href="#sec-3.5.2">3.5.2 Private opera </a></li>
<li><a href="#sec-3.5.3">3.5.3 Collaborative opera </a></li>
</ul>
</li>
<li><a href="#sec-3.6">3.6 Editions (branches) </a></li>
<li><a href="#sec-3.7">3.7 TOC </a>
<ul>
<li><a href="#sec-3.7.1">3.7.1 TOC Links </a></li>
<li><a href="#sec-3.7.2">3.7.2 TOC Modification </a></li>
<li><a href="#sec-3.7.3">3.7.3 TOC Modelization </a></li>
</ul>
</li>
<li><a href="#sec-3.8">3.8 Content </a>
<ul>
<li><a href="#sec-3.8.1">3.8.1 Textual content </a></li>
<li><a href="#sec-3.8.2">3.8.2 Link to an external resource </a></li>
<li><a href="#sec-3.8.3">3.8.3 Plugins </a></li>
</ul>
</li>
<li><a href="#sec-3.9">3.9 Annotations </a>
<ul>
<li><a href="#sec-3.9.1">3.9.1 TOC entry annotation </a></li>
</ul>
</li>
<li><a href="#sec-3.10">3.10 Rendering engines </a>
<ul>
<li><a href="#sec-3.10.1">3.10.1 Built-in rendering engines </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Use cases </a>
<ul>
<li><a href="#sec-4.1">4.1 Normal User </a>
<ul>
<li><a href="#sec-4.1.1">4.1.1 Basical Hypomnemata usage </a></li>
<li><a href="#sec-4.1.2">4.1.2 Basical Blog usage </a></li>
<li><a href="#sec-4.1.3">4.1.3 Basic Private Book Compilation </a></li>
<li><a href="#sec-4.1.4">4.1.4 Basic Collective Book Creation </a></li>
<li><a href="#sec-4.1.5">4.1.5 Basic commenting / annotation usage </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Project presentation </h2>
<div id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 Motivation </h3>
<div id="text-1.1">

<p>Software development is growing a social way of working. Tools such
as <a href="http://www.github.com">Github</a> allow to share one's programs with other programmers, who
may take the program, copy it on their own repository, work on it
by themselves, and propose modifications. Then, useful
contributions can be merged into the mother repository.
</p>
<p>
There is no reason we could not apply the same kind of pattern to
philosophy. People have thoughts worth sharing, worth
adopting. Actually this kind of pattern is already used among
intellectuals, musicians, etc. Everybody borrows from the others.
But there is no infrastructure for doing so.
</p>
<p>
But it is hard to genuinely borrow from Epictetus. Because his
books have been translated into many different languages, many
times, and without a careful study of the footnotes, and careful
comparison between several editions, one may easily be mislead by
the translator(s).
</p>
<p>
The goal of the described application is to answer a certain number
of issues, among which classical text accessibility, and ease in
sharing one's thoughts among other people caring about the same
topic. The application is not usable only by the stoic community,
although the stoic community is its initial target. The same
principle apply to any community whose common reference is mostly
found in textual material.
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Considerations and responses </h2>
<div id="text-2">


<p>
This section presents the project by trying to list a certain number
of considerations sorted by main themes. These considerations lead
to informal business requirements that the application must
address.
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">2.1 About classical texts </h3>
<div id="text-2.1">


</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1">2.1.1 Considerations expression </h4>
<div id="text-2.1.1">

<ul>
<li>
There is no global repository to find official or important texts
in Stoicism.
</li>
<li>
There are many different versions of these texts, translated by
many authors in many different languages. Some of them match in
their table of contents, some other don't.
</li>
<li>
There is no easy way to refer to the original texts, nor to
compare the different editions.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2">2.1.2 Responses to the considerations </h4>
<div id="text-2.1.2">

<p>This document describes an application which:
</p><ul>
<li>
hosts the reference texts,
</li>
<li>
allows to compare the editions easily.

</li>
</ul>

<p>The users are able to:
</p><ul>
<li>
collect references into personal anthologies,
</li>
<li>
comment or annotate parts of the reference texts.
</li>
<li>
export/render the reference opera or anthologies into booklets.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">2.2 About contemporary knowledge creation </h3>
<div id="text-2.2">


</div>

<div id="outline-container-2.2.1" class="outline-4">
<h4 id="sec-2.2.1">2.2.1 Considerations expression </h4>
<div id="text-2.2.1">

<ul>
<li>
There are today's works which deserve to be treated as important
advances to stoicism.
</li>
<li>
Nobody can tell today which of these works will be considered as
classic texts in the future (if any).
</li>
<li>
The stoic community can group its efforts to produce important
contributions to the stoic philosophy.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.2.2" class="outline-4">
<h4 id="sec-2.2.2">2.2.2 Responses to the considerations </h4>
<div id="text-2.2.2">

<p>This document describes an application which:
</p><ul>
<li>
allows anybody to create an 'author' account,
</li>
<li>
allows anybody to share his/her own texts,
</li>
<li>
allows anybody to allow anybody to copy and modify his/her own
texts,
</li>
<li>
allows common efforts to be forked/merged, exactly the same way
it is done in software development,
</li>
<li>
allows people to comment/annotate other people's texts,
</li>
<li>
render texts from other users as PDF books/booklets.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">2.3 About privacy and decentralization </h3>
<div id="text-2.3">


</div>

<div id="outline-container-2.3.1" class="outline-4">
<h4 id="sec-2.3.1">2.3.1 Considerations expression </h4>
<div id="text-2.3.1">

<ul>
<li>
Personal data is a critical topic. Users of online
services/applications become aware of their privacy and wish to
have full rights over the content they have produced.
</li>
<li>
Different communities may generate content independently, and yet
wish to share their product with other communities.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.3.2" class="outline-4">
<h4 id="sec-2.3.2">2.3.2 Responses to the considerations </h4>
<div id="text-2.3.2">

<p>This document describes an application which:
</p><ul>
<li>
proposes a protocol of communication between its different
instances, so that each instance of the application is able
to reference other instances and fetch data from them,
</li>
<li>
rests upon open architectures in matters of authentication to
facilitate the user's navigation between servers,
</li>
<li>
allows users to easily restrict other user's access to their
content.
</li>
</ul>

<p>The fact that this application's usage may be spread accross many
countries, with different legislations regarding intellectual
property and copyrights, makes necessary that all users agree on
terms of utilization. These terms are targeted at two goals :
</p><ul>
<li>
allow people to protect the content they want to keep private (as
hypomnemata, or work-in-progress translations, etc.),
</li>
<li>
encourage the sharing of knowledge, by making compulsorily public
the content which has been borrowed from other people.


</li>
</ul>
</div>
</div>

</div>
