spec.org
*** Considerations expression
    + Table of contents (TOC) between several editions of the same
      opus may change.
    + There is no standard TOC architecture. Books may be subdivised
      into tomes, volumes, parts, chapters, sections, subsections of
      order n, paragraphs, sometimes sentences with highly scrutinized
      classical texts such as the ones from Plato or Aristotle.
    + Not only the TOC, but the TOC structure may vary between several
      editions of the same opus.
    + When reading a classic text, it is very helpful to be able to
      see easily what is the text of the same TOC entry in another
      edition.

*** Responses to the considerations
    This document describes an application which:
      + allows to easily manage the TOC of an edition,
      + allows to easily integrate a TOC from a new edition with the
        TOC of the already existing editions,
      + allows to easily navigate between the TOC entries between
        several editions of the same opus,
      + allows to easily link to a TOC entry in a particular edition
        of an opus,
      + allows to easily link to an abstract TOC entry in all the
        known editions of an opus, this abstract TOC entry referencing
        all the corresponding TOC entries within the editions.




** About internationalization
*** Considerations expression
    + Human natural languages are highly diverse.
    + Some scripts are read left to right, some other right to left.
    + Representing all possible translations of a certain content
      means to have highly customized formatting.

*** Responses to the considerations
    This document describes an application which:
      + has all its formatting templates ready for
        internationalization,
      + allows to display different languages (meaning using different
        formatting templates) within the same pages.


** Usage examples
   Users may :
   + create anthology booklet,
   + transcribe and share an ancient edition (free of copyrights) of
     Epictetus' Manual in English,
   + comment and annotate this edition,
   + link its table of contents to the other editions,
   + create their own hypomnemata repository,
   + create a blog-like personal repository,
   + collect interesting posts from internet forums and edit them into
     a book,
   + provide a new translation of Seneca Letters,
   + etc.


* Concepts and Types of objects

** Languages
*** Introduction
    Languages are very difficult to define.
    The application has two different usage of languages:
    + application graphical user interface (GUI)
    + data content categorization

    There must be a good balance between complexity and ease of use.
    The languages in both of these instances are regarded as the same
    entities, and stored in the same place.

*** GUI
    Some languages are available for the GUI.
    The GUI can be displayed in English, French, Spanish, etc.

*** Data content categorization
    Some languages, which are not spoken anymore, need to be created
    to categorize the texts.
    For example, texts can be set as being written in Latin or Ancient
    Greek, although there is no possibility to set the GUI in these
    languages.


** Authors
*** Classic authors
    A classic author is an author whose works are in the public domain.

    Authors such as Epictetus or Seneca are classic authors.

    Classic authors can be controlled by users having acquired the
    rights to modify public author accounts.

*** Quoted authors
    A quoted author is an author whose opera are not in the public
    domain, and has no attached user account.

    A quoted author may become a private author if the physical person
    corresponding to this author opens an account and proves his/her
    identity to an administrator.

*** Private authors
    A private author is an author attached to a User account. It is
    controlled solely by the User.

** Karma
*** Definition
    The karma points directly represent the user's contribution to the
    community of users.
*** Scope                                                        :BR_KAR001:
    Each user has karma points.
*** Karma modification                                           :BR_KAR002:
    When a user's contribution is upvoted by other users, the user's
    karma goes up (like the square root of numbers of upvotes to
    minimize the effect of focus on already high-voted items).

** Users
   Several types of users exist for the stoic-resources application.

*** Typology
**** User
     When a new user has just registered.

**** Administrator
     An administrator is a user with all rights activated.

*** User rights
    According to his/her karma, or whether the user is an
    administrator, certain functionalities are allowed. Here is a list
    of such functionalities.

**** Level 0
     Rights acquired by sole account creation
***** Create a private opus
***** Create a private edition
***** Create entries in a private edition
***** Comment and annotate one's own content
***** Export one's edition
**** Level 1
***** Fork an edition
***** Comment and annotate other's content
**** Level 2
***** Create a collaborative opus
**** Level 3
***** Edit content in classic opera
**** Level 4
***** Edit content in quoted author opera
**** Level 5
     Administrator level
***** Edit or delete any content (comments, entries, etc.)
** Opera (repositories)
   An opus is a repository for content.

   An opus has a set of authors.

   This set may change with time, according to who participates in it.

*** Classic opera
    A classic opus is an opus by a classic author. Its content is editable
    by all the users who have the proper right for it.

*** Private opera
    A private opus is one that belongs to a private author, and can be
    modified only by this author. Private opera may be opened to comments
    though.

*** Collaborative opera
    A collaborative opus is one that is opened to any User who has the
    right to contribute to collaborative opera. It is close to the idea of
    a wiki.

