spec.html

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4">2.4 About table of contents </h3>
<div id="text-2.4">


</div>

<div id="outline-container-2.4.1" class="outline-4">
<h4 id="sec-2.4.1">2.4.1 Considerations expression </h4>
<div id="text-2.4.1">

<ul>
<li>
Table of contents (TOC) between several editions of the same
opus may change.
</li>
<li>
There is no standard TOC architecture. Books may be subdivised
into tomes, volumes, parts, chapters, sections, subsections of
order n, paragraphs, sometimes sentences with highly scrutinized
classical texts such as the ones from Plato or Aristotle.
</li>
<li>
Not only the TOC, but the TOC structure may vary between several
editions of the same opus.
</li>
<li>
When reading a classic text, it is very helpful to be able to
see easily what is the text of the same TOC entry in another
edition.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.4.2" class="outline-4">
<h4 id="sec-2.4.2">2.4.2 Responses to the considerations </h4>
<div id="text-2.4.2">

<p>This document describes an application which:
</p><ul>
<li>
allows to easily manage the TOC of an edition,
</li>
<li>
allows to easily integrate a TOC from a new edition with the
TOC of the already existing editions,
</li>
<li>
allows to easily navigate between the TOC entries between
several editions of the same opus,
</li>
<li>
allows to easily link to a TOC entry in a particular edition
of an opus,
</li>
<li>
allows to easily link to an abstract TOC entry in all the
known editions of an opus, this abstract TOC entry referencing
all the corresponding TOC entries within the editions.




</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5">2.5 About internationalization </h3>
<div id="text-2.5">


</div>

<div id="outline-container-2.5.1" class="outline-4">
<h4 id="sec-2.5.1">2.5.1 Considerations expression </h4>
<div id="text-2.5.1">

<ul>
<li>
Human natural languages are highly diverse. Some scripts are
read left to right, some other right to left.
</li>
<li>
Representing all possible translations of a certain content
means to have highly customized renderings.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.5.2" class="outline-4">
<h4 id="sec-2.5.2">2.5.2 Responses to the considerations </h4>
<div id="text-2.5.2">

<p>This document describes an application which:
</p><ul>
<li>
has all its formatting templates ready for
internationalization,
</li>
<li>
allows to display different languages (meaning using different
formatting templates) within the same pages.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6">2.6 Usage examples </h3>
<div id="text-2.6">

<p>Users may :
</p><ul>
<li>
create anthology booklet,
</li>
<li>
transcribe and share an ancient edition (free of copyrights) of
Epictetus' Manual in English,
</li>
<li>
comment and annotate this edition,
</li>
<li>
link its table of contents to the other editions,
</li>
<li>
create their own hypomnemata repository,
</li>
<li>
create a blog-like personal repository,
</li>
<li>
collect interesting posts from internet forums and edit them into
a book,
</li>
<li>
provide a new translation of Seneca Letters,
</li>
<li>
etc.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Concepts and Types of objects </h2>
<div id="text-3">



</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 Languages </h3>
<div id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1">3.1.1 Introduction </h4>
<div id="text-3.1.1">

<p>Languages are very difficult to define.
The application has two different usage of languages:
</p><ul>
<li>
application graphical user interface (GUI)
</li>
<li>
data content categorization

</li>
</ul>

<p>There must be a good balance between complexity and ease of use.
The languages in both of these instances are regarded as the same
entities, and stored in the same place.
</p>
</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2">3.1.2 GUI </h4>
<div id="text-3.1.2">

<p>Some languages are available for the GUI.
The GUI can be displayed in English, French, Spanish, etc.
</p>
</div>

</div>

<div id="outline-container-3.1.3" class="outline-4">
<h4 id="sec-3.1.3">3.1.3 Data content categorization </h4>
<div id="text-3.1.3">

<p>Some languages, which are not spoken anymore, need to be created
to categorize the texts.
For example, texts can be set as being written in Latin or Ancient
Greek, although there is no possibility to set the GUI in these
languages.
</p>

</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 Authors </h3>
<div id="text-3.2">


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1">3.2.1 Classic authors </h4>
<div id="text-3.2.1">

<p>A classic author is an author whose works are in the public domain.
</p>
<p>
Authors such as Epictetus or Seneca are classic authors.
</p>
<p>
Classic authors can be controlled by users having acquired the
rights to modify public author accounts.
</p>
</div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2">3.2.2 Quoted authors </h4>
<div id="text-3.2.2">

<p>A quoted author is an author whose opera are not in the public
domain, and has no attached user account.
</p>
<p>
A quoted author may become a private author if the physical person
corresponding to this author opens an account and proves his/her
identity to an administrator.
</p>
</div>

</div>

<div id="outline-container-3.2.3" class="outline-4">
<h4 id="sec-3.2.3">3.2.3 Private authors </h4>
<div id="text-3.2.3">

<p>A private author is an author attached to a User account. It is
controlled solely by the User.
</p>
</div>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 Karma </h3>
<div id="text-3.3">


</div>

<div id="outline-container-3.3.1" class="outline-4">
<h4 id="sec-3.3.1">3.3.1 Definition </h4>
<div id="text-3.3.1">

<p>The karma points directly represent the user's contribution to the
community of users.
</p></div>

</div>

<div id="outline-container-3.3.2" class="outline-4">
<h4 id="sec-3.3.2">3.3.2 Scope &nbsp;&nbsp;&nbsp;<span class="tag">BR_KAR001</span></h4>
<div id="text-3.3.2">

<p>Each user has karma points.
</p></div>

</div>

<div id="outline-container-3.3.3" class="outline-4">
<h4 id="sec-3.3.3">3.3.3 Karma modification &nbsp;&nbsp;&nbsp;<span class="tag">BR_KAR002</span></h4>
<div id="text-3.3.3">

<p>When a user's contribution is upvoted by other users, the user's
karma goes up (like the square root of numbers of upvotes to
minimize the effect of focus on already high-voted items).
</p>
</div>
</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4">3.4 Users </h3>
<div id="text-3.4">

<p>Several types of users exist for the stoic-resources application.
</p>

</div>

<div id="outline-container-3.4.1" class="outline-4">
<h4 id="sec-3.4.1">3.4.1 Typology </h4>
<div id="text-3.4.1">

<ul>
<li id="sec-3.4.1.1">User <br/>
When a new user has just registered.

</li>
<li id="sec-3.4.1.2">Administrator <br/>
An administrator is a user with all rights activated.

</li>
</ul>
</div>

</div>

<div id="outline-container-3.4.2" class="outline-4">
<h4 id="sec-3.4.2">3.4.2 User rights </h4>
<div id="text-3.4.2">

<p>According to his/her karma, or whether the user is an
administrator, certain functionalities are allowed. Here is a list
of such functionalities.
</p>
<ul>
<li id="sec-3.4.2.1">Level 0 <br/>
Rights acquired by sole account creation
<ul>
<li id="sec-3.4.2.1.1">Create a private opus <br/>
</li>
<li id="sec-3.4.2.1.2">Create a private edition <br/>
</li>
<li id="sec-3.4.2.1.3">Create entries in a private edition <br/>
</li>
<li id="sec-3.4.2.1.4">Comment and annotate one's own content <br/>
</li>
<li id="sec-3.4.2.1.5">Export one's edition <br/>
</li>
</ul>
</li>
<li id="sec-3.4.2.2">Level 1 <br/>
<ul>
<li id="sec-3.4.2.2.1">Fork an edition <br/>
</li>
<li id="sec-3.4.2.2.2">Comment and annotate other's content <br/>
</li>
</ul>
</li>
<li id="sec-3.4.2.3">Level 2 <br/>
<ul>
<li id="sec-3.4.2.3.1">Create a collaborative opus <br/>
</li>
</ul>
</li>
<li id="sec-3.4.2.4">Level 3 <br/>
<ul>
<li id="sec-3.4.2.4.1">Edit content in classic opera <br/>
</li>
</ul>
</li>
<li id="sec-3.4.2.5">Level 4 <br/>
<ul>
<li id="sec-3.4.2.5.1">Edit content in quoted author opera <br/>
</li>
</ul>
</li>
<li id="sec-3.4.2.6">Level 5 <br/>
Administrator level
<ul>
<li id="sec-3.4.2.6.1">Edit or delete any content (comments, entries, etc.) <br/>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5">3.5 Opera (repositories) </h3>
<div id="text-3.5">

<p>An opus is a repository for content.
</p>
<p>
An opus has a set of authors.
</p>
<p>
This set may change with time, according to who participates in it.
</p>

</div>

<div id="outline-container-3.5.1" class="outline-4">
<h4 id="sec-3.5.1">3.5.1 Classic opera </h4>
<div id="text-3.5.1">

<p>A classic opus is an opus by a classic author. Its content is editable
by all the users who have the proper right for it.
</p>
</div>

</div>

<div id="outline-container-3.5.2" class="outline-4">
<h4 id="sec-3.5.2">3.5.2 Private opera </h4>
<div id="text-3.5.2">

<p>A private opus is one that belongs to a private author, and can be
modified only by this author. Private opera may be opened to comments
though.
</p>
</div>

</div>

<div id="outline-container-3.5.3" class="outline-4">
<h4 id="sec-3.5.3">3.5.3 Collaborative opera </h4>
<div id="text-3.5.3">

<p>A collaborative opus is one that is opened to any User who has the
right to contribute to collaborative opera. It is close to the idea of
a wiki.
</p>
</div>
</div>

</div>
