spec.org
** Editions (branches)
   An edition refers to a special version of an opus.
   Look at it as a tagged version of an opus, or a branch.
   Each opus can have any number of editions.
   An edition has a set of authors, which may or may not be the same as
   its corresponding opus.

** TOC
   An edition may have a TOC.
*** TOC Links
    + Each element of the TOC may point to any number of other TOC entries
      from other editions, (including editions from other opera).
      This allows to know which other TOC entries outside this edition
      reflect the current TOC entry content.
    + A graph of all the TOC entries can be generated to get all the TOC
      entries related to the current one.
*** TOC Modification
    A side project, javascript library called orgjs, allows to easily
    modify the TOC. Simple drag/drop for moving entries, and tools for
    searching other edition entries for linking purposes.
*** TOC Modelization
    A TOC entry has two sides : a concrete side and an astract side.
    The abstract side allows to group several TOC entries and link
    between them.

    Abstract entries are not seen by users, it is just an artifact to
    allow easy navigation between several editions.

    The purpose of the abstract entry layer is to allow the User to
    link easily to all the other corresponding TOC entries, without
    relying on one of them in particular.

    Three models have been considered :
    + chained links between TOC entries, each concrete entry pointing
      to another concrete entry ; this model breaks when one link in
      the chain breaks,
    + use of a higher-level opus default TOC (not attached to an
      edition in particular, each edition pointing to entries from the
      opus TOC) ; unfortunately this means that people wishing to
      create new TOC entries in their own private edition must be able
      to create entries in the opus default edition, or else they
      can't link to anything ; the opus TOC could easily become a mess
      if there are many editions,
    + use of an automatic abstract level of entries, hidden from the
      user ; this models combines all advantages of the previous
      options (ease of linking from #1 and coherence from #2).

    Suppose we have 3 editions of Seneca's Letters. I create a new
    edition for this opus. I recently discovered an unknown letter,
    and add it to my TOC.
    + An abstract TOC entry is created.
    + Somebody links to this letter and provides his own translation,
      in another edition. By linking to my letter's TOC entry, he
      actually links to the abstract TOC entry.
    + Somebody else elaborates on the letter and links his own
      corrected translation on the first translator's TOC entry. This
      links to the very same abstract link.
    + The first translator thinks this letter is a fake, and removes
      it from his edition. The second translator still points to the
      unchanged abstract link (still existing because two TOC entries
      still point to it).
    + It becomes a general consensus that this letter is a fake. I
      delete my own TOC entry to it. The second translator still has
      his own translation, and the abstract TOC entry still exists.
    + The second translators finds that there is no point in keeping
      his translation, and deletes the TOC entry. The abstract TOC
      entry is now unused, it is suppressed.

**** Abstract entry creation
     + An abstract entry is created any time a new TOC entry is created,
       and is not linked to an other TOC entry.
     + An abstract entry is created when a TOC entry which was
       pointing to other entries does not point to these entries
       anymore.
**** Abstract entry deletion
     + An abstract entry is deleted when the corresponding TOC entry
       is linked to at least another TOC entry, or is deleted, and
       there is no more concrete entry for this abstract entry.

** Content
*** Textual content
*** Link to an external resource
*** Plugins
    Plugins are available to treat the content and allow special
    editing modes.
**** Formal argumentation content plugin
     The main plugin shipped with the application is a formal
     argumentation editor. Content will be treated as a formal
     argumentation containing logical connectors (premisses
     declaration ;if A then B else C; since A then B; etc.). Another
     specification will be issued for this particular plugin.
**** 'org-mode'-like plugin
     A plugin exists to treat content (TOC included), as an org-mode
     document. Special key events are attached to the document to
     perform the same tasks as in org-mode.

** Annotations
*** TOC entry annotation
    Any TOC entry is annotable.
    If an edition is split until the sentence level, then all the
    sentences are annotable.

** Rendering engines
   Rendering engines allow to format an edition into human readable
   presentation.

   The authors of a book can choose which rendering engines are
   available.

   Rendering engines have a structure of plugin. Some built-in
   rendering engines are provided with the application.
*** Built-in rendering engines
**** PDF book rendering engines
     This rendering engine formats a content with LaTeX.
**** Online book rendering engine
     This rendering engine presents the edition with table of
     contents, links, etc., as HTML.
**** Blog rendering engine
     This rendering engine presents the edition and its entries as a
     blog.
**** Hypomnemata rendering engine
     This rendering engine presents the edition as a micro-bloging
     thread.


* Use cases

  Zeno, Cleanthes and Chrysippus are users of the system.

** Normal User
*** Basical Hypomnemata usage
    + Zeno creates a private author page.
    + Zeno creates a new private opus : his hypomnemata. A base
      edition is automatically created for this opus.
    + Zeno enters new entries into his edition.
    + Zeno builds a TOC for organizing his entries.
      The interface for creating a TOC allows to easily generate an
      outline, resembling the org-mode system.
      Zeno can easily drag/drop his entries into his outline.
    + Zeno exports his hypomnemata into a PDF booklet.
    + Zeno can then use a third-party website to edit his hypomnemata
      into a real book, or print it by himself.
*** Basical Blog usage
    + Same as a Hypomnemata usage.
    + A dedicated rendering engine allows to present the entries as a
      blog (listed by descending date, with a calendar, showing numbr
      of comments, etc.).
