spec.html

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6">3.6 Editions (branches) </h3>
<div id="text-3.6">

<p>An edition refers to a special version of an opus.
Look at it as a tagged version of an opus, or a branch.
Each opus can have any number of editions.
An edition has a set of authors, which may or may not be the same as
its corresponding opus.
</p>
</div>

</div>

<div id="outline-container-3.7" class="outline-3">
<h3 id="sec-3.7">3.7 TOC </h3>
<div id="text-3.7">

<p>An edition may have a TOC.
</p>
</div>

<div id="outline-container-3.7.1" class="outline-4">
<h4 id="sec-3.7.1">3.7.1 TOC Links </h4>
<div id="text-3.7.1">

<ul>
<li>
Each element of the TOC may point to any number of other TOC entries
from other editions, (including editions from other opera).
This allows to know which other TOC entries outside this edition
reflect the current TOC entry content.
</li>
<li>
A graph of all the TOC entries can be generated to get all the TOC
entries related to the current one.
</li>
</ul>
</div>

</div>

<div id="outline-container-3.7.2" class="outline-4">
<h4 id="sec-3.7.2">3.7.2 TOC Modification </h4>
<div id="text-3.7.2">

<p>A side project, javascript library called orgjs, allows to easily
modify the TOC. Simple drag/drop for moving entries, and tools for
searching other edition entries for linking purposes.
</p></div>

</div>

<div id="outline-container-3.7.3" class="outline-4">
<h4 id="sec-3.7.3">3.7.3 TOC Modelization </h4>
<div id="text-3.7.3">

<p>A TOC entry has two sides : a concrete side and an astract side.
The abstract side allows to group several TOC entries and link
between them.
</p>
<p>
Abstract entries are not seen by users, it is just an artifact to
allow easy navigation between several editions.
</p>
<p>
The purpose of the abstract entry layer is to allow the User to
link easily to all the other corresponding TOC entries, without
relying on one of them in particular.
</p>
<p>
Three models have been considered :
</p><ul>
<li>
chained links between TOC entries, each concrete entry pointing
to another concrete entry ; this model breaks when one link in
the chain breaks,
</li>
<li>
use of a higher-level opus default TOC (not attached to an
edition in particular, each edition pointing to entries from the
opus TOC) ; unfortunately this means that people wishing to
create new TOC entries in their own private edition must be able
to create entries in the opus default edition, or else they
can't link to anything ; the opus TOC could easily become a mess
if there are many editions,
</li>
<li>
use of an automatic abstract level of entries, hidden from the
user ; this models combines all advantages of the previous
options (ease of linking from #1 and coherence from #2).

</li>
</ul>

<p>Suppose we have 3 editions of Seneca's Letters. I create a new
edition for this opus. I recently discovered an unknown letter,
and add it to my TOC.
</p><ul>
<li>
An abstract TOC entry is created.
</li>
<li>
Somebody links to this letter and provides his own translation,
in another edition. By linking to my letter's TOC entry, he
actually links to the abstract TOC entry.
</li>
<li>
Somebody else elaborates on the letter and links his own
corrected translation on the first translator's TOC entry. This
links to the very same abstract link.
</li>
<li>
The first translator thinks this letter is a fake, and removes
it from his edition. The second translator still points to the
unchanged abstract link (still existing because two TOC entries
still point to it).
</li>
<li>
It becomes a general consensus that this letter is a fake. I
delete my own TOC entry to it. The second translator still has
his own translation, and the abstract TOC entry still exists.
</li>
<li>
The second translators finds that there is no point in keeping
his translation, and deletes the TOC entry. The abstract TOC
entry is now unused, it is suppressed.

</li>
<li id="sec-3.7.3.1">Abstract entry creation <br/>
<ul>
<li>
An abstract entry is created any time a new TOC entry is created,
and is not linked to an other TOC entry.
</li>
<li>
An abstract entry is created when a TOC entry which was
pointing to other entries does not point to these entries
anymore.
</li>
</ul>
</li>
<li id="sec-3.7.3.2">Abstract entry deletion <br/>
<ul>
<li>
An abstract entry is deleted when the corresponding TOC entry
is linked to at least another TOC entry, or is deleted, and
there is no more concrete entry for this abstract entry.

</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.8" class="outline-3">
<h3 id="sec-3.8">3.8 Content </h3>
<div id="text-3.8">


</div>

<div id="outline-container-3.8.1" class="outline-4">
<h4 id="sec-3.8.1">3.8.1 Textual content </h4>
<div id="text-3.8.1">

</div>

</div>

<div id="outline-container-3.8.2" class="outline-4">
<h4 id="sec-3.8.2">3.8.2 Link to an external resource </h4>
<div id="text-3.8.2">

</div>

</div>

<div id="outline-container-3.8.3" class="outline-4">
<h4 id="sec-3.8.3">3.8.3 Plugins </h4>
<div id="text-3.8.3">

<p>Plugins are available to treat the content and allow special
editing modes.
</p><ul>
<li id="sec-3.8.3.1">Formal argumentation content plugin <br/>
The main plugin shipped with the application is a formal
argumentation editor. Content will be treated as a formal
argumentation containing logical connectors (premisses
declaration ;if A then B else C; since A then B; etc.). Another
specification will be issued for this particular plugin.
</li>
<li id="sec-3.8.3.2">'org-mode'-like plugin <br/>
A plugin exists to treat content (TOC included), as an org-mode
document. Special key events are attached to the document to
perform the same tasks as in org-mode.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.9" class="outline-3">
<h3 id="sec-3.9">3.9 Annotations </h3>
<div id="text-3.9">


</div>

<div id="outline-container-3.9.1" class="outline-4">
<h4 id="sec-3.9.1">3.9.1 TOC entry annotation </h4>
<div id="text-3.9.1">

<p>Any TOC entry is annotable.
If an edition is split until the sentence level, then all the
sentences are annotable.
</p>
</div>
</div>

</div>

<div id="outline-container-3.10" class="outline-3">
<h3 id="sec-3.10">3.10 Rendering engines </h3>
<div id="text-3.10">

<p>Rendering engines allow to format an edition into human readable
presentation.
</p>
<p>
The authors of a book can choose which rendering engines are
available.
</p>
<p>
Rendering engines have a structure of plugin. Some built-in
rendering engines are provided with the application.
</p>
</div>

<div id="outline-container-3.10.1" class="outline-4">
<h4 id="sec-3.10.1">3.10.1 Built-in rendering engines </h4>
<div id="text-3.10.1">

<ul>
<li id="sec-3.10.1.1">PDF book rendering engines <br/>
This rendering engine formats a content with LaTeX.
</li>
<li id="sec-3.10.1.2">Online book rendering engine <br/>
This rendering engine presents the edition with table of
contents, links, etc., as HTML.
</li>
<li id="sec-3.10.1.3">Blog rendering engine <br/>
This rendering engine presents the edition and its entries as a
blog.
</li>
<li id="sec-3.10.1.4">Hypomnemata rendering engine <br/>
This rendering engine presents the edition as a micro-bloging
thread.


</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Use cases </h2>
<div id="text-4">


<p>
Zeno, Cleanthes and Chrysippus are users of the system.
</p>

</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 Normal User </h3>
<div id="text-4.1">


</div>

<div id="outline-container-4.1.1" class="outline-4">
<h4 id="sec-4.1.1">4.1.1 Basical Hypomnemata usage </h4>
<div id="text-4.1.1">

<ul>
<li>
Zeno creates a private author page.
</li>
<li>
Zeno creates a new private opus : his hypomnemata. A base
edition is automatically created for this opus.
</li>
<li>
Zeno enters new entries into his edition.
</li>
<li>
Zeno builds a TOC for organizing his entries.
The interface for creating a TOC allows to easily generate an
outline, resembling the org-mode system.
Zeno can easily drag/drop his entries into his outline.
</li>
<li>
Zeno exports his hypomnemata into a PDF booklet.
</li>
<li>
Zeno can then use a third-party website to edit his hypomnemata
into a real book, or print it by himself.
</li>
</ul>
</div>

</div>

<div id="outline-container-4.1.2" class="outline-4">
<h4 id="sec-4.1.2">4.1.2 Basical Blog usage </h4>
<div id="text-4.1.2">

<ul>
<li>
Same as a Hypomnemata usage.
</li>
<li>
A dedicated rendering engine allows to present the entries as a
blog (listed by descending date, with a calendar, showing numbr
of comments, etc.).
</li>
</ul>
</div>

</div>
