spec.org
*** Basic Private Book Compilation
    + Zeno creates a new opus. A base edition for this opus is
      automatically created.
    + Zeno visits classic opera, and drag/drops some of the TOC
      entries into his opus' base edition.
    + Zeno creates a TOC structure for his edition and drag/drops his
      collected entries into his TOC entries.
    + Zeno generates an export of his edition (for example as a PDF).
    + Zeno creates a second edition for his opus. The TOC is copied
      from the base edition. Zeno changes the architecure a bit, adds
      some entries, adds comments and notes to the existing entries.
    + Zeno exports the second edition.

*** Basic Collective Book Creation
    + Zeno creates an open opus. A base edition is created.
    + Zeno adds a few entries.
    + Cleanthes joins the open opus.
    + Cleanthes add a few entries.
    + Zeno adds a TOC.
    + Cleanthes affects new entries to TOC entries.
    + Chrysippus make a branch of the opus, copying the base edition
      into his own edition.
    + Chrysippus edits some entries.
    + Cleanthes, seing Chrysippus' entries are interesting, imports
      them into the base edition.
    + Zeno creates a second edition of the opus.
      There are now 3 editions : base, Chrysippus', Zeno's.

*** Basic commenting / annotation usage
    + Zeno browses the Epictetus' Encheiridion, several editions are
      available on the system.
    + Zeno




