spec.html

<div id="outline-container-4.1.3" class="outline-4">
<h4 id="sec-4.1.3">4.1.3 Basic Private Book Compilation </h4>
<div id="text-4.1.3">

<ul>
<li>
Zeno creates a new opus. A base edition for this opus is
automatically created.
</li>
<li>
Zeno visits classic opera, and drag/drops some of the TOC
entries into his opus' base edition.
</li>
<li>
Zeno creates a TOC structure for his edition and drag/drops his
collected entries into his TOC entries.
</li>
<li>
Zeno generates an export of his edition (for example as a PDF).
</li>
<li>
Zeno creates a second edition for his opus. The TOC is copied
from the base edition. Zeno changes the architecure a bit, adds
some entries, adds comments and notes to the existing entries.
</li>
<li>
Zeno exports the second edition.

</li>
</ul>
</div>

</div>

<div id="outline-container-4.1.4" class="outline-4">
<h4 id="sec-4.1.4">4.1.4 Basic Collective Book Creation </h4>
<div id="text-4.1.4">

<ul>
<li>
Zeno creates an open opus. A base edition is created.
</li>
<li>
Zeno adds a few entries.
</li>
<li>
Cleanthes joins the open opus.
</li>
<li>
Cleanthes add a few entries.
</li>
<li>
Zeno adds a TOC.
</li>
<li>
Cleanthes affects new entries to TOC entries.
</li>
<li>
Chrysippus make a branch of the opus, copying the base edition
into his own edition.
</li>
<li>
Chrysippus edits some entries.
</li>
<li>
Cleanthes, seing Chrysippus' entries are interesting, imports
them into the base edition.
</li>
<li>
Zeno creates a second edition of the opus.
There are now 3 editions : base, Chrysippus', Zeno's.

</li>
</ul>
</div>

</div>

<div id="outline-container-4.1.5" class="outline-4">
<h4 id="sec-4.1.5">4.1.5 Basic commenting / annotation usage </h4>
<div id="text-4.1.5">

<ul>
<li>
Zeno browses the Epictetus' Encheiridion, several editions are
available on the system.
</li>
<li>
Zeno




</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: subtenante
<a href="mailto:subtenante@muTyP">&lt;subtenante@muTyP&gt;</a>
</p>
<p class="date"> Date: 2010-05-19 07:33:19 CEST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
